//------------------------------------------------------------------------- //
//		AVR e Arduino: Técnicas de Projeto, 2a ed. - 2012.					//	
//-------------------------------------------------------------------------	//

//-------------------------------------------------------------------------
// Filtro de média móvel com 16 amostras para o sinal do ADC
//-------------------------------------------------------------------------
unsigned int x[16], y;
. . .
ISR(ADC_vect)	
{
	unsigned char i=15;
	
	y=0;
	do 
	{
		x[i] = x[i-1];	//anda um passo nas amostras anteriores
		y += x[i];
		i--;
		
	} while (i!=0);
	
	x[0]=ADC;			//nova amostra entra no filtro
	y = (y + x[0])/16;	//sinal filtrado
}
//--------------------------------------------------------------------------
